//==============================================================================
// figure-in.c - реализация обобщенной функции ввода фигуры,
// переопределяемой различными обработчиками специализации.
// Реализована как абстракная функция.
//==============================================================================
#include <stdio.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
void FigureIn<struct Figure *f>(FILE* file) {}// = 0;
