#ifndef __circle__
#define __circle__

#include "shape.h"

//==============================================================================
// circle.h - описание круга
//==============================================================================

//------------------------------------------------------------------------------
// круг
typedef struct circle {
  int r; // радиус круга
} circle;

// круг как специализация (можно и в отдельном файле)
shape + <circle;>;

#endif // __circle__

