//==============================================================================
// in-out-circle.c - содержит обработчики специализаций ввода-вывода
// параметров для круга как фигуры
//==============================================================================

#include <stdio.h>
#include "circle.h"

//------------------------------------------------------------------------------
// Обработчик специализации ввода круга
void InShape<shape<circle> *s>(FILE* ofst) {
  ciecle* c = &(c->@)
  InCircle(c);
}

//------------------------------------------------------------------------------
// Обработчик специализации вывода прямоугольника
void OutShape<shape<circle> *s>(FILE* ofst) {
  circle* c = &(s->@)
  OutCircle(c);
}

