//==============================================================================
// in-out-rect-trian.c - содержит обработчики специализаций ввода-вывода
// параметров для прямоугольника и треугольника как фигуры
//==============================================================================

#include <stdio.h>
#include "shape.h"

//------------------------------------------------------------------------------
// Обработчик специализации ввода прямоугольника
void InShape<shape<rectangle> *s>(FILE* ofst) {
  rectangle* r = &(s->@)
  InRectangle(r);
}

//------------------------------------------------------------------------------
// Обработчик специализации вывода прямоугольника
void OutShape<shape<rectangle> *s>(FILE* ofst) {
  rectangle* r = &(s->@)
  OutRectangle(r);
}

//------------------------------------------------------------------------------
// Обработчик специализации ввода треугольника
void InShape<shape<triangle> *s>(FILE* ofst) {
  InTriangle(&(s->@));
}

//------------------------------------------------------------------------------
// Обработчик специализации вывода треугольника
void OutShape<shape<triangle> *s>(FILE* ofst) {
  OutTriangle(&(s->@));
}
