//==============================================================================
// shape-in.c - содержит процедуру ввода параметров
// и создания произвольной фигуры
//==============================================================================

#include "shape.h"

//------------------------------------------------------------------------------
// Ввод параметров обобщенной фигуры из файла
// Это единственная функция, которая не расширяется эволюционно.
// Хотя можно сделать и эволюционное расширение тоже.
shape* CreateAndInShape(FILE* ifst)
{
  shape *sp;
  int k;
  fscanf(ifst, "%d", &(k));
  switch(k) {
  case 1:
    sp = malloc(sizeof(shape<rectangle>));
    break;
  case 2:
    sp = malloc(sizeof(shape<triangle>));
    break;
  case 3:
    sp = malloc(sizeof(shape<circle>));
    break;
  default:
    return 0;
  }
  In<sp>(ifst);
}
