//==============================================================================
// triangle-out.c - содержит процедуру
// вывода параметров треугольника
//==============================================================================

#include <stdio.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void OutTriangle(triangle *t, FILE *ofst) {
  fprintf(ofst, "It is Triangle: a = %d, b = %d, c = %d\n", t->a, t->b, t->c);
}

