//==============================================================================
// figure-rectangle-in.c - Обработчик специализации, осуществляющий
// ввод прямоугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include "figure-rectangle.h"
#include <stdio.h>

//------------------------------------------------------------------------------
// Прототип функции ввода прямоугольника
void RectangleIn(Rectangle* r, FILE* ifst);
// Прототип обобщеннай функции ввода фигуры
void FigureIn<Figure * f>(FILE* file);

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureIn<Figure<Rectangle> * f>(FILE* ifst)
{
    RectangleIn(&(f->@), ifst);
}
