//==============================================================================
// triangle-in.c - содержит функцию ввода параметров
// для уже созданного треугольника
//==============================================================================

#include <stdio.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void TriangleIn(Triangle *t, FILE* ifst) {
  fscanf(ifst, "%d", &(t->a));
  fscanf(ifst, "%d", &(t->b));
  fscanf(ifst, "%d", &(t->c));
}
