#ifndef __container__
#define __container__

//==============================================================================
// container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры
// для представленной реализации контейнера не требуется
struct shape;

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
struct container {
  enum {max_len = 100}; // максимальная длина
  int len; // текущая длина
  shape *cont[max_len];
};

#endif // __container__