//==============================================================================
// triangle-out.cpp - содержит процедуру
// вывода параметров треугольника
//==============================================================================

#include <fstream>
#include "triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void Out(triangle &t, std::ofstream &ofst) {
  ofst << "It is Triangle: a = "
    << t.a << ", b = " << t.b
    << ", c = " << t.c << "\n";
}

