//==============================================================================
// figure.c - функции, задающие работу с обобщенными фигурами
// и их специализациями
//==============================================================================

#include "figure.h"

//------------------------------------------------------------------------------
// Прототипы функций вывода основ специализаций
void SimpleRectangleIn(SimpleRectangle *r, FILE* ifst);
void SimpleRectangleOut(SimpleRectangle *r, FILE* ofst);
void SimpleTriangleIn(SimpleTriangle *t, FILE* ifst);
void SimpleTriangleOut(SimpleTriangle *t,FILE* ofst);

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
void FigureIn<Figure *f>(FILE* file) {} //= 0;

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureIn<Figure<SimpleRectangle> *f>(FILE* ifst) {
  SimpleRectangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureIn<Figure<SimpleTriangle> *f>(FILE* ifst) {
  SimpleTriangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Обобщенная функция вывода любой фигуры
void FigureOut<Figure *f>(FILE* ofst) {} //= 0;

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства прямоугольников
void FigureOut<Figure<SimpleRectangle> *f>(FILE* ofst) {
  SimpleRectangleOut(&(f->@), ofst);
}

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства треугольников
void FigureOut<Figure<SimpleTriangle> *f>(FILE* ofst) {
  SimpleTriangleOut(&(f->@), ofst);
}
