//------------------------------------------------------------------------------
// simple-creator.c - определения обобщенного создателя и обработчиков
// специализаций, имитирующих реализацию фабричного метода
//------------------------------------------------------------------------------

#include "simple-creator.h"
#include "figure.h"

//------------------------------------------------------------------------------
// Обобщенная функция создателя является чистой
Figure* CreateFigure<SimpleCreator *f>() {} //= 0;

//------------------------------------------------------------------------------
// Создатель прямоугольников-специализаций
Figure* CreateFigure<SimpleCreator<rect>  *f>() {
  return create_spec<struct Figure<struct SimpleRectangle> >();
}

//------------------------------------------------------------------------------
// Создатель треугольников-специализаций
Figure* CreateFigure<SimpleCreator<trian> *f>() {
  return create_spec<struct Figure<struct SimpleTriangle> >();
}
