//==============================================================================
// figure.c - функции, задающие работу с обобщенными фигурами
// и их специализациями
//==============================================================================

#include <stdio.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Прототипы функций ввода основ специализаций
void RectangleIn(Rectangle *r, FILE* ifst);
void TriangleIn(Triangle *t, FILE* ifst);
// Прототипы функций вывода основ специализаций
void SimpleRectangleOut(SimpleRectangle *r, FILE* ofst);
void SimpleTriangleOut(SimpleTriangle *t,FILE* ofst);

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
void FigureIn<Figure *f>(FILE* file) = 0;

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureIn<Figure<Rectangle> *f>(FILE* ifst) {
  RectangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureIn<Figure<Triangle> *f>(FILE* ifst) {
  TriangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Обобщенная функция вывода любой фигуры
void FigureOut<Figure *f>(FILE* ofst) = 0;

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства прямоугольников
void FigureOut<Figure<SimpleRectangle> *f>(FILE* ofst) {
  SimpleRectangleOut(f->@, ofst);
}

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства треугольников
void FigureOut<Figure<SimpleTriangle> *f>(FILE* ofst) {
  SimpleTriangleOut(f->@, ofst);
}
