//==============================================================================
// figure-rectangle-perimeter.c - Обработчик специализации, осуществляющий
// вычисление периметра прямоугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Прототип функции вычисления периметра прямоугольника
double RectanglePerimeter(Rectangle *r);
// Прототип обобщенной функции вычисления периметра
double FigurePerimeter<struct Figure *f>();

//------------------------------------------------------------------------------
// Периметр прямоугольника как фигуры
void FigurePerimeter<struct Figure<struct Rectangle> *f>() {
  RectanglePerimeter(&f->@);
}
