//==============================================================================
// container-rectangles-out.c - содержит функцию вывода только прямоугольников,
// находящихся в контейнере, используя обобщенную функцию,
// вывода только прямоугольников
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Прототип обобщенной функции, осуществляющей вывод только прямоугольников
void FigureRectangleOnlyOut<struct Figure* s>(FILE* ofst);

//------------------------------------------------------------------------------
// Вывод прямоугольников из контейнера в указанный поток
void ContainerRectangleOnlyOut(Container *c, FILE* ofst) {
  int rectCount = 0;
  for(int i = 0; i < c->len; i++) {
    if(FigureRectangleOnlyOut<c->cont[i]>(ofst)) {
        ++rectCount;
    }
  }
  fprintf(ofst, "Container contains %d rectangles.\n", rectCount);
}
