//==============================================================================
// container-constr.c - содержит процедуры
// начальной инициализации и очистки (утилизации) контейнера
//==============================================================================

#include <stdlib.h>
#include "container.h"
#include "shape.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
void InitContainer(container *c) {
  c->len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void ClearContainer(container *c) {
  for(int i = 0; i < c->len; i++) {
    free(c->cont[i]);
  }
  InitContainer(c);
}
