//==============================================================================
// rectangle-out.c - содержит процедуру
// вывода параметров прямоугольника
//==============================================================================

#include <stdio.h>
#include "rectangle.h"

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void OutRectangle(rectangle *r, FILE* ofst) {
  fprintf(ofst, "It is Rectangle: x = %d, y = %d\n", r->x, r->y);
}
