#ifndef __shape__
#define __shape__

//==============================================================================
// shape.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

#include "rectangle.h"
#include "triangle.h"
#include "circle.h"

//------------------------------------------------------------------------------
// значения ключей для каждой из фигур
typedef enum key {RECTANGLE, TRIANGLE, CIRCLE} key;

//------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
typedef struct shape {
  key k; // ключ
  // используемые альтернативы
  union { // используем простейшую реализацию
    rectangle r;
    triangle  t;
    circle    c;
  };
} shape;

#endif // __shape__