//==============================================================================
// in-out-circle.c - содержит обработчики специализаций ввода-вывода
// параметров для круга как фигуры
//==============================================================================

#include <stdio.h>
#include "figure-circle.h"

//------------------------------------------------------------------------------
// Прототип функции вывода круга
void CircleOut(Circle *c, FILE* ofst);
// Прототип обобщеннай функции вывода фигуры
void FigureOut<Figure *f>(FILE* ofst);

//------------------------------------------------------------------------------
// Вывод круга как фигуры
void FigureOut<Figure<circ> *f>(FILE* ofst) {
  Circle* c = &(f->@);
  CircleOut(c, ofst);
}

