#ifndef __is_figure_rectangle__
#define __is_figure_rectangle__

//==============================================================================
// is-figure-rectangle.h - содержит прототип обобщенной функции проверки,
// является ли фигура прямоугольником
//==============================================================================

#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Прототип функции определяющей, является ли фигура прямоугольником
bool isFigureRectangle<Figure * f>();

#endif // __is_figure_rectangle__