//------------------------------------------------------------------------------
// applique-collector.c - содержит функцию формирования аппликации
// простого домика
//------------------------------------------------------------------------------

#include "builder.h"

//------------------------------------------------------------------------------
// Класс, формирующий аппликацию.

void AppliqueCollector(std::ofstream &ofst, Builder* builder) {
  BuildRectangle<builder>(20, 15);      // окно
  BuildRectangle<builder>(100, 80);     // здание
  BuildRectangle<builder>(20, 60);      // дверь
  BuildTriangle<builder>(120, 80, 70);  // крыша
}