//==============================================================================
// figure.c - функции, задающие работу с обобщенными фигурами
// и их специализациями
//==============================================================================

#include <stdio.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Прототипы функций вывода фигур
void SimpleRectangleOut(SimpleRectangle *r, FILE* ofst);
void SimpleTriangleOut(SimpleTriangle *t,FILE* ofst);

//------------------------------------------------------------------------------
// Обобщенная функция вывода любой фигуры
void FigureOut<Figure *f>(FILE* ofst) = 0;

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства прямоугольников
void FigureOut<Figure<SimpleRectangle> *f>(FILE* ofst) {
  SimpleRectangleOut(f->@, ofst);
}

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства треугольников
void FigureOut<Figure<SimpleTriangle> *f>(FILE* ofst) {
  SimpleTriangleOut(f->@, ofst);
}
