#ifndef __simple_rectangle__
#define __simple_rectangle__

//==============================================================================
// simple-rectangle.h - содержит описание прямоугольника
//==============================================================================

//------------------------------------------------------------------------------
// прямоугольник
typedef struct SimpleRectangle {
  double x, y; // ширина, высота
} SimpleRectangle;

#endif // __simple_rectangle__