#ifndef __spec_builders__
#define __spec_builders__

//------------------------------------------------------------------------------
// spec-builders.h - основы специализаций
// для строительства из простых фигур и подсчета.
// Собраны вмести для упрощения кода.
//------------------------------------------------------------------------------

#include "figure-container.h"

//------------------------------------------------------------------------------
// Строитель из простых фигур
struct SimpleBuilder {
  FigureContainer* container; // связь с контейнером.
}

//------------------------------------------------------------------------------
// Счетчик фигур
struct CounterBuilder {
  int rectanglesCounter;
  int trianglesCounter;
}

#endif // __spec_builders__