//==============================================================================
// figure-rectangle-in.c - Обработчик специализации, осуществляющий
// ввод прямоугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Прототип функции ввода прямоугольника
void RectangleIn(Rectangle *r, FILE* ifst);

// Прототип обобщеннай функции ввода фигуры
void FigureIn<struct Figure *f>(FILE* file);

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureIn<struct Figure<struct Rectangle> *f> (FILE* ifst) {
  RectangleIn(&(f->@), ifst);
}
