//==============================================================================
// container-in.c - содержит процедуру
// ввода фигур в контейнер из потока
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
struct shape *InShape(FILE* ifdt);
struct shape* CreateAndInShape(FILE* ifst);
//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void InContainer(container* c, FILE* ifst) {
  while(!feof(ifst))  {
    if((c->cont[c->len] = CreateAndInShape(ifst)) != 0) {
      c->len++;
    }
  }
}
