#ifndef __figure__
#define __figure__

//==============================================================================
// figure.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================
#include <stdio.h>
// #include "rectangle.h"
// #include "triangle.h"

//------------------------------------------------------------------------------
// структура, обобщающая фигуры
typedef struct Figure {} <> Figure;

void FigureInput<struct Figure *f>(FILE* file);

#endif // __figure__