//==============================================================================
// figure-rectangle-out.c - Обработчик специализации, осуществляющий
// вывод прямоугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Прототип функции вывода прямоугольника
void RectangleOut(Rectangle *r, FILE* ifst);

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureOutput<struct Figure<struct Rectangle> *f>(FILE* ofst) {
  RectangleOut(&(f->@), ofst);
}
