#ifndef __figure_triangle__
#define __figure_triangle__

//==============================================================================
// figure-triangle.h - описание специализации фигуры как треугольника
//==============================================================================

#include "figure.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Фигура - треугольник
struct Figure + < struct Triangle; >;

#endif // __figure_triangle__
