//==============================================================================
// figure-triangle-in.c - Обработчик специализации, осуществляющий
// ввод треугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Прототип функции ввода треугольника
void TriangleIn(Triangle *t, FILE* ifst);

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureInput<struct Figure<struct Triangle> *f>(FILE* ifst) {
  TriangleIn(&(f->@), ifst);
}
