//==============================================================================
// figure-triangle-out.c - Обработчик специализации, осуществляющий
// вывод треугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Прототип функции вывода треугольника
void TriangleOut(Triangle *t, FILE* ifst);

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureOutput<struct Figure<struct Triangle> *f>(FILE* ofst) {
  TriangleOut(&(f->@), ofst);
}
