//==============================================================================
// rect-trian-in-out.c - содержит обработчики специализаций ввода-вывода
// параметров для прямоугольника и треугольника как фигуры
//==============================================================================

#include <stdio.h>
#include "figure.h"
#include "figure-rectangle.h"
#include "figure-triangle.h"
//------------------------------------------------------------------------------
// Обработчик специализации ввода прямоугольника
// void FigureInput<struct Figure<struct Rectangle> *s>(FILE* ofst) {
//   Rectangle* r = &(s->@);
//   RectangleIn(r);
// }

//------------------------------------------------------------------------------
// Обработчик специализации вывода прямоугольника
// void FigureOutput<struct Figure<struct Rectangle> *s>(FILE* ofst) {
//   Rectangle* r = &(s->@);
//   RectangleOut(r);
// }

//------------------------------------------------------------------------------
// Обработчик специализации ввода треугольника
// void FigureInput<struct Figure<struct Triangle> *s>(FILE* ofst) {
//   TriangleIn(&(s->@));
// }

//------------------------------------------------------------------------------
// Обработчик специализации вывода треугольника
// void FigureOutput<struct Figure<struct Triangle> *s>(FILE* ofst) {
//   TriangleOut(&(s->@));
// }
