#ifndef __shape__
#define __shape__

//==============================================================================
// shape.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
typedef struct shape {} < rectangle; triangle; > shape;

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
void InShape<shape *sh>(FILE* file) = 0;

//------------------------------------------------------------------------------
// Обобщающая функция для вывода параметров фигуры
void OutShape<shape *sh>(FILE* file) = 0;

#endif // __shape__