//==============================================================================
// container-out.cpp - содержит процедуру
// вывода содержимого контейнера
//==============================================================================

#include <fstream>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
void Out(shape &s, std::ofstream &ofst);

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void Out(container &c, std::ofstream &ofst) {
  ofst << "Container contains " << c.len << " elements." << "\n";
  for(int i = 0; i < c.len; i++) {
    ofst << i << ": ";
    Out(*(c.cont[i]), ofst);
  }
}
