//==============================================================================
// rectangle-in.cpp - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//==============================================================================

#include <fstream>
#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void In(rectangle &r, std::ifstream &ifst) {
  ifst >> r.x >> r.y;
}
