#ifndef __shape__
#define __shape__

//==============================================================================
// shape.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
struct shape {
  // значения ключей для каждой из фигур
  enum key {RECTANGLE, TRIANGLE};
  key k; // ключ
  // используемые альтернативы
  union { // используем простейшую реализацию
    rectangle r;
    triangle t;
  };
};

#endif // __shape__