//==============================================================================
// triangle-in.cpp - содержит процедуру ввода параметров
// для уже созданного треугольника
//==============================================================================

#include <fstream>
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void In(triangle &t, std::ifstream &ifst) {
  ifst >> t.a >> t.b >> t.c;
}
