//==============================================================================
// container-in.c - содержит функцию ввода фигур в контейнер из потока
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
struct Figure *FigureCreateAndIn(FILE* ifdt);

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void ContainerIn(Container* c, FILE* ifst, FigureFactory* factory) {
  while(!feof(ifst))  {
    if((c->cont[c->len] = FigureCreateAndIn(ifst, factory)) != 0) {
      c->len++;
    }
  }
}
