#ifndef __rectangle__
#define __rectangle__

//------------------------------------------------------------------------------
// rectangle.h - содержит описание обобщенного прямоугольника,
// формируемого из конкретных фигур
// Технически можно сделать эволюцию, но для паттерна это несущественно
//------------------------------------------------------------------------------

#include "simple-rectangle.h"
#include "coord-rectangle.h"

//------------------------------------------------------------------------------
// прямоугольник
typedef struct Rectangle {} <SimpleRectangle; CoordRectangle;> Rectangle;

#endif // __rectangle__
