#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание обобщенного треугольника,
// формируемого из конкретных фигур
// Технически можно сделать эволюцию, но для паттерна это несущественно
//------------------------------------------------------------------------------

#include "simple-triangle.h"
#include "coord-triangle.h"

//------------------------------------------------------------------------------
// треугольник
typedef struct Triangle {} <SimpleTriangle; CoordTriangle;> Triangle;

#endif // __triangle__