//==============================================================================
// figure-perimeter.c - содержит функцию вычисления периметра
// для произвольной геометрической фигуры
//==============================================================================

#include <stdio.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
double RectanglePerimeter(Rectangle *r);
double TrianglePerimeter(Triangle *t);

//------------------------------------------------------------------------------
// Вычисление периметра для текущей фигуры
double FigurePerimeter(Figure *s)
{
  switch(s->k) {
  case RECTANGLE:
    return RectanglePerimeter(&(s->r));
    break;
  case TRIANGLE:
    return TrianglePerimeter(&(s->t));
    break;
  default:
    return 0.0;
  }
}
