//==============================================================================
// is-figure-rectangle.c - описания обобщенной функции и обработчика
// специлизации, проверяющих на то что фигура является прямоугольником
//==============================================================================

#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Обобщенная функция определяющая, является ли фигура прямоугольником
bool isFigureRectangle<Figure * f>() {
  return false;
}

//------------------------------------------------------------------------------
// Обобщенная функция определяющая, является ли фигура прямоугольником
bool isFigureRectangle<Figure<Rectangle> * f>() {
  return true;
}
